/***********************************
** This is an auto-generated file **
**       DO NOT EDIT BELOW        **
************************************/

#ifndef ASIC_REG_STRUCTS_GAUDI2_ARC_DUP_ENG_H_
#define ASIC_REG_STRUCTS_GAUDI2_ARC_DUP_ENG_H_

#include <stdint.h>
#include "gaudi2_types.h"
#include "axuser_regs.h"
#include "special_regs_regs.h"

#pragma pack(push, 1)

#ifdef __cplusplus
namespace gaudi2 {
namespace arc_dup_eng {
#else
#	ifndef static_assert
#		if defined( __STDC__ ) && defined( __STDC_VERSION__ ) && __STDC_VERSION__ >= 201112L
#			define static_assert(...) _Static_assert(__VA_ARGS__)
#		else
#			define static_assert(...)
#		endif
#	endif
#endif

/*
 DUP_TPC_ENG_ADDR_0 
 b'DUP:TPC (GRP0): TPC_0 Address'
*/
typedef struct reg_dup_tpc_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_0;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_0) == 4), "reg_dup_tpc_eng_addr_0 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_1 
 b'DUP:TPC (GRP0): TPC_1 Address'
*/
typedef struct reg_dup_tpc_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_1;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_1) == 4), "reg_dup_tpc_eng_addr_1 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_2 
 b'DUP:TPC (GRP0): TPC_2 Address'
*/
typedef struct reg_dup_tpc_eng_addr_2 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_2;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_2) == 4), "reg_dup_tpc_eng_addr_2 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_3 
 b'DUP:TPC (GRP0): TPC_3 Address'
*/
typedef struct reg_dup_tpc_eng_addr_3 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_3;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_3) == 4), "reg_dup_tpc_eng_addr_3 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_4 
 b'DUP:TPC (GRP0): TPC_4 Address'
*/
typedef struct reg_dup_tpc_eng_addr_4 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_4;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_4) == 4), "reg_dup_tpc_eng_addr_4 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_5 
 b'DUP:TPC (GRP0): TPC_5 Address'
*/
typedef struct reg_dup_tpc_eng_addr_5 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_5;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_5) == 4), "reg_dup_tpc_eng_addr_5 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_6 
 b'DUP:TPC (GRP0): TPC_6 Address'
*/
typedef struct reg_dup_tpc_eng_addr_6 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_6;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_6) == 4), "reg_dup_tpc_eng_addr_6 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_7 
 b'DUP:TPC (GRP0): TPC_7 Address'
*/
typedef struct reg_dup_tpc_eng_addr_7 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_7;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_7) == 4), "reg_dup_tpc_eng_addr_7 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_8 
 b'DUP:TPC (GRP0): TPC_8 Address'
*/
typedef struct reg_dup_tpc_eng_addr_8 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_8;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_8) == 4), "reg_dup_tpc_eng_addr_8 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_9 
 b'DUP:TPC (GRP0): TPC_9 Address'
*/
typedef struct reg_dup_tpc_eng_addr_9 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_9;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_9) == 4), "reg_dup_tpc_eng_addr_9 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_10 
 b'DUP:TPC (GRP0): TPC_10 Address'
*/
typedef struct reg_dup_tpc_eng_addr_10 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_10;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_10) == 4), "reg_dup_tpc_eng_addr_10 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_11 
 b'DUP:TPC (GRP0): TPC_11 Address'
*/
typedef struct reg_dup_tpc_eng_addr_11 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_11;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_11) == 4), "reg_dup_tpc_eng_addr_11 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_12 
 b'DUP:TPC (GRP0): TPC_12 Address'
*/
typedef struct reg_dup_tpc_eng_addr_12 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_12;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_12) == 4), "reg_dup_tpc_eng_addr_12 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_13 
 b'DUP:TPC (GRP0): TPC_13 Address'
*/
typedef struct reg_dup_tpc_eng_addr_13 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_13;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_13) == 4), "reg_dup_tpc_eng_addr_13 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_14 
 b'DUP:TPC (GRP0): TPC_14 Address'
*/
typedef struct reg_dup_tpc_eng_addr_14 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_14;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_14) == 4), "reg_dup_tpc_eng_addr_14 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_15 
 b'DUP:TPC (GRP0): TPC_15 Address'
*/
typedef struct reg_dup_tpc_eng_addr_15 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_15;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_15) == 4), "reg_dup_tpc_eng_addr_15 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_16 
 b'DUP:TPC (GRP0): TPC_16 Address'
*/
typedef struct reg_dup_tpc_eng_addr_16 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_16;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_16) == 4), "reg_dup_tpc_eng_addr_16 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_17 
 b'DUP:TPC (GRP0): TPC_17 Address'
*/
typedef struct reg_dup_tpc_eng_addr_17 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_17;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_17) == 4), "reg_dup_tpc_eng_addr_17 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_18 
 b'DUP:TPC (GRP0): TPC_18 Address'
*/
typedef struct reg_dup_tpc_eng_addr_18 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_18;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_18) == 4), "reg_dup_tpc_eng_addr_18 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_19 
 b'DUP:TPC (GRP0): TPC_19 Address'
*/
typedef struct reg_dup_tpc_eng_addr_19 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_19;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_19) == 4), "reg_dup_tpc_eng_addr_19 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_20 
 b'DUP:TPC (GRP0): TPC_20 Address'
*/
typedef struct reg_dup_tpc_eng_addr_20 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_20;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_20) == 4), "reg_dup_tpc_eng_addr_20 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_21 
 b'DUP:TPC (GRP0): TPC_21 Address'
*/
typedef struct reg_dup_tpc_eng_addr_21 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_21;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_21) == 4), "reg_dup_tpc_eng_addr_21 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_22 
 b'DUP:TPC (GRP0): TPC_22 Address'
*/
typedef struct reg_dup_tpc_eng_addr_22 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_22;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_22) == 4), "reg_dup_tpc_eng_addr_22 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_23 
 b'DUP:TPC (GRP0): TPC_23 Address'
*/
typedef struct reg_dup_tpc_eng_addr_23 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_23;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_23) == 4), "reg_dup_tpc_eng_addr_23 size is not 32-bit");
/*
 DUP_TPC_ENG_ADDR_24 
 b'DUP:TPC (GRP0): TPC_24 Address'
*/
typedef struct reg_dup_tpc_eng_addr_24 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_addr_24;
static_assert((sizeof(struct reg_dup_tpc_eng_addr_24) == 4), "reg_dup_tpc_eng_addr_24 size is not 32-bit");
/*
 DUP_MME_ENG_ADDR_0 
 b'DUP:MME (GRP1): MME_0 Address'
*/
typedef struct reg_dup_mme_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_mme_eng_addr_0;
static_assert((sizeof(struct reg_dup_mme_eng_addr_0) == 4), "reg_dup_mme_eng_addr_0 size is not 32-bit");
/*
 DUP_MME_ENG_ADDR_1 
 b'DUP:MME (GRP1): MME_1 Address'
*/
typedef struct reg_dup_mme_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_mme_eng_addr_1;
static_assert((sizeof(struct reg_dup_mme_eng_addr_1) == 4), "reg_dup_mme_eng_addr_1 size is not 32-bit");
/*
 DUP_MME_ENG_ADDR_2 
 b'DUP:MME (GRP1): MME_2 Address'
*/
typedef struct reg_dup_mme_eng_addr_2 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_mme_eng_addr_2;
static_assert((sizeof(struct reg_dup_mme_eng_addr_2) == 4), "reg_dup_mme_eng_addr_2 size is not 32-bit");
/*
 DUP_MME_ENG_ADDR_3 
 b'DUP:MME (GRP1): MME_3 Address'
*/
typedef struct reg_dup_mme_eng_addr_3 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_mme_eng_addr_3;
static_assert((sizeof(struct reg_dup_mme_eng_addr_3) == 4), "reg_dup_mme_eng_addr_3 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_0 
 b'DUP:NIC: (GRP 6..13): NIC_0 Address'
*/
typedef struct reg_dup_nic_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_0;
static_assert((sizeof(struct reg_dup_nic_eng_addr_0) == 4), "reg_dup_nic_eng_addr_0 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_1 
 b'DUP:NIC: (GRP 6..13) NIC_1 Address'
*/
typedef struct reg_dup_nic_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_1;
static_assert((sizeof(struct reg_dup_nic_eng_addr_1) == 4), "reg_dup_nic_eng_addr_1 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_2 
 b'DUP:NIC: (GRP 6..13) NIC_2 Address'
*/
typedef struct reg_dup_nic_eng_addr_2 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_2;
static_assert((sizeof(struct reg_dup_nic_eng_addr_2) == 4), "reg_dup_nic_eng_addr_2 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_3 
 b'DUP:NIC: (GRP 6..13) NIC_3 Address'
*/
typedef struct reg_dup_nic_eng_addr_3 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_3;
static_assert((sizeof(struct reg_dup_nic_eng_addr_3) == 4), "reg_dup_nic_eng_addr_3 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_4 
 b'DUP:NIC: (GRP 6..13)NIC_4 Address'
*/
typedef struct reg_dup_nic_eng_addr_4 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_4;
static_assert((sizeof(struct reg_dup_nic_eng_addr_4) == 4), "reg_dup_nic_eng_addr_4 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_5 
 b'DUP:NIC: (GRP 6..13) NIC_5 Address'
*/
typedef struct reg_dup_nic_eng_addr_5 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_5;
static_assert((sizeof(struct reg_dup_nic_eng_addr_5) == 4), "reg_dup_nic_eng_addr_5 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_6 
 b'DUP:NIC: (GRP 6..13) NIC_6 Address'
*/
typedef struct reg_dup_nic_eng_addr_6 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_6;
static_assert((sizeof(struct reg_dup_nic_eng_addr_6) == 4), "reg_dup_nic_eng_addr_6 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_7 
 b'DUP:NIC: (GRP 6..13) NIC_7 Address'
*/
typedef struct reg_dup_nic_eng_addr_7 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_7;
static_assert((sizeof(struct reg_dup_nic_eng_addr_7) == 4), "reg_dup_nic_eng_addr_7 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_8 
 b'DUP:NIC: (GRP 6..13) NIC_8 Address'
*/
typedef struct reg_dup_nic_eng_addr_8 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_8;
static_assert((sizeof(struct reg_dup_nic_eng_addr_8) == 4), "reg_dup_nic_eng_addr_8 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_9 
 b'DUP:NIC: (GRP 6..13) NIC_9 Address'
*/
typedef struct reg_dup_nic_eng_addr_9 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_9;
static_assert((sizeof(struct reg_dup_nic_eng_addr_9) == 4), "reg_dup_nic_eng_addr_9 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_10 
 b'DUP:NIC:(GRP 6..13) NIC_10 Address'
*/
typedef struct reg_dup_nic_eng_addr_10 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_10;
static_assert((sizeof(struct reg_dup_nic_eng_addr_10) == 4), "reg_dup_nic_eng_addr_10 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_11 
 b'DUP:NIC: (GRP 6..13) NIC_11 Address'
*/
typedef struct reg_dup_nic_eng_addr_11 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_11;
static_assert((sizeof(struct reg_dup_nic_eng_addr_11) == 4), "reg_dup_nic_eng_addr_11 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_12 
 b'DUP:NIC: (GRP 6..13) NIC_12 Address'
*/
typedef struct reg_dup_nic_eng_addr_12 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_12;
static_assert((sizeof(struct reg_dup_nic_eng_addr_12) == 4), "reg_dup_nic_eng_addr_12 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_13 
 b'DUP:NIC: (GRP 6..13) NIC_13 Address'
*/
typedef struct reg_dup_nic_eng_addr_13 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_13;
static_assert((sizeof(struct reg_dup_nic_eng_addr_13) == 4), "reg_dup_nic_eng_addr_13 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_14 
 b'DUP:NIC: (GRP 6..13) NIC_14 Address'
*/
typedef struct reg_dup_nic_eng_addr_14 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_14;
static_assert((sizeof(struct reg_dup_nic_eng_addr_14) == 4), "reg_dup_nic_eng_addr_14 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_15 
 b'DUP:NIC: (GRP 6..13) NIC_15 Address'
*/
typedef struct reg_dup_nic_eng_addr_15 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_15;
static_assert((sizeof(struct reg_dup_nic_eng_addr_15) == 4), "reg_dup_nic_eng_addr_15 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_16 
 b'DUP:NIC: (GRP 6..13) NIC_16 Address'
*/
typedef struct reg_dup_nic_eng_addr_16 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_16;
static_assert((sizeof(struct reg_dup_nic_eng_addr_16) == 4), "reg_dup_nic_eng_addr_16 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_17 
 b'DUP:NIC: (GRP 6..13) NIC_17 Address'
*/
typedef struct reg_dup_nic_eng_addr_17 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_17;
static_assert((sizeof(struct reg_dup_nic_eng_addr_17) == 4), "reg_dup_nic_eng_addr_17 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_18 
 b'DUP:NIC:(GRP 6..13)  NIC_18 Address'
*/
typedef struct reg_dup_nic_eng_addr_18 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_18;
static_assert((sizeof(struct reg_dup_nic_eng_addr_18) == 4), "reg_dup_nic_eng_addr_18 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_19 
 b'DUP:NIC: (GRP 6..13) NIC_19 Address'
*/
typedef struct reg_dup_nic_eng_addr_19 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_19;
static_assert((sizeof(struct reg_dup_nic_eng_addr_19) == 4), "reg_dup_nic_eng_addr_19 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_20 
 b'DUP:NIC: (GRP 6..13) NIC_20 Address'
*/
typedef struct reg_dup_nic_eng_addr_20 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_20;
static_assert((sizeof(struct reg_dup_nic_eng_addr_20) == 4), "reg_dup_nic_eng_addr_20 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_21 
 b'DUP:NIC: (GRP 6..13) NIC_21 Address'
*/
typedef struct reg_dup_nic_eng_addr_21 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_21;
static_assert((sizeof(struct reg_dup_nic_eng_addr_21) == 4), "reg_dup_nic_eng_addr_21 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_22 
 b'DUP:NIC: (GRP 6..13) NIC_22 Address'
*/
typedef struct reg_dup_nic_eng_addr_22 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_22;
static_assert((sizeof(struct reg_dup_nic_eng_addr_22) == 4), "reg_dup_nic_eng_addr_22 size is not 32-bit");
/*
 DUP_NIC_ENG_ADDR_23 
 b'DUP:NIC: (GRP 6..13) NIC_23 Address'
*/
typedef struct reg_dup_nic_eng_addr_23 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_addr_23;
static_assert((sizeof(struct reg_dup_nic_eng_addr_23) == 4), "reg_dup_nic_eng_addr_23 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_0 
 b'DUP:EDMA (GRP 2): EDMA_0 Address'
*/
typedef struct reg_dup_edma_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_0;
static_assert((sizeof(struct reg_dup_edma_eng_addr_0) == 4), "reg_dup_edma_eng_addr_0 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_1 
 b'DUP:EDMA (GRP 2): EDMA_1 Address'
*/
typedef struct reg_dup_edma_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_1;
static_assert((sizeof(struct reg_dup_edma_eng_addr_1) == 4), "reg_dup_edma_eng_addr_1 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_2 
 b'DUP:EDMA (GRP 2): EDMA_2 Address'
*/
typedef struct reg_dup_edma_eng_addr_2 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_2;
static_assert((sizeof(struct reg_dup_edma_eng_addr_2) == 4), "reg_dup_edma_eng_addr_2 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_3 
 b'DUP:EDMA (GRP 2): EDMA_3 Address'
*/
typedef struct reg_dup_edma_eng_addr_3 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_3;
static_assert((sizeof(struct reg_dup_edma_eng_addr_3) == 4), "reg_dup_edma_eng_addr_3 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_4 
 b'DUP:EDMA (GRP 2): EDMA_4 Address'
*/
typedef struct reg_dup_edma_eng_addr_4 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_4;
static_assert((sizeof(struct reg_dup_edma_eng_addr_4) == 4), "reg_dup_edma_eng_addr_4 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_5 
 b'DUP:EDMA (GRP 2): EDMA_5 Address'
*/
typedef struct reg_dup_edma_eng_addr_5 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_5;
static_assert((sizeof(struct reg_dup_edma_eng_addr_5) == 4), "reg_dup_edma_eng_addr_5 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_6 
 b'DUP:EDMA (GRP 2): EDMA_6 Address'
*/
typedef struct reg_dup_edma_eng_addr_6 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_6;
static_assert((sizeof(struct reg_dup_edma_eng_addr_6) == 4), "reg_dup_edma_eng_addr_6 size is not 32-bit");
/*
 DUP_EDMA_ENG_ADDR_7 
 b'DUP:EDMA (GRP 2): EDMA_7 Address'
*/
typedef struct reg_dup_edma_eng_addr_7 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_addr_7;
static_assert((sizeof(struct reg_dup_edma_eng_addr_7) == 4), "reg_dup_edma_eng_addr_7 size is not 32-bit");
/*
 DUP_PDMA_ENG_ADDR_0 
 b'DUP:PDMA (GRP 3): PDMA_0 Address'
*/
typedef struct reg_dup_pdma_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_pdma_eng_addr_0;
static_assert((sizeof(struct reg_dup_pdma_eng_addr_0) == 4), "reg_dup_pdma_eng_addr_0 size is not 32-bit");
/*
 DUP_PDMA_ENG_ADDR_1 
 b'DUP:PDMA (GRP 3): PDMA_1 Address'
*/
typedef struct reg_dup_pdma_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_pdma_eng_addr_1;
static_assert((sizeof(struct reg_dup_pdma_eng_addr_1) == 4), "reg_dup_pdma_eng_addr_1 size is not 32-bit");
/*
 DUP_ROT_ENG_ADDR_0 
 b'DUP:ROT: (GRP 4): ROT_0 Address'
*/
typedef struct reg_dup_rot_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rot_eng_addr_0;
static_assert((sizeof(struct reg_dup_rot_eng_addr_0) == 4), "reg_dup_rot_eng_addr_0 size is not 32-bit");
/*
 DUP_ROT_ENG_ADDR_1 
 b'DUP:ROT: (GRP 4): ROT_1 Address'
*/
typedef struct reg_dup_rot_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rot_eng_addr_1;
static_assert((sizeof(struct reg_dup_rot_eng_addr_1) == 4), "reg_dup_rot_eng_addr_1 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_0 
 b'DUP:RSRV: (GRP 5): ADDR_0 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_0 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_0;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_0) == 4), "reg_dup_rsvd_eng_addr_0 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_1 
 b'DUP:RSRV: (GRP 5): ADDR_1 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_1 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_1;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_1) == 4), "reg_dup_rsvd_eng_addr_1 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_2 
 b'DUP:RSRV: (GRP 5):ADDR_2 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_2 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_2;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_2) == 4), "reg_dup_rsvd_eng_addr_2 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_3 
 b'DUP:RSRV: (GRP 5):ADDR_3 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_3 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_3;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_3) == 4), "reg_dup_rsvd_eng_addr_3 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_4 
 b'DUP:RSRV: (GRP 5):ADDR_4 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_4 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_4;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_4) == 4), "reg_dup_rsvd_eng_addr_4 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_5 
 b'DUP:RSRV: (GRP 5):ADDR_5 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_5 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_5;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_5) == 4), "reg_dup_rsvd_eng_addr_5 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_6 
 b'DUP:RSRV: (GRP 5):ADDR_6 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_6 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_6;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_6) == 4), "reg_dup_rsvd_eng_addr_6 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_7 
 b'DUP:RSRV: (GRP 5): ADDR_7 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_7 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_7;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_7) == 4), "reg_dup_rsvd_eng_addr_7 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_8 
 b'DUP:RSRV: (GRP 5): ADDR_8 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_8 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_8;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_8) == 4), "reg_dup_rsvd_eng_addr_8 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_9 
 b'DUP:RSRV (GRP 5):: ADDR_9 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_9 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_9;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_9) == 4), "reg_dup_rsvd_eng_addr_9 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_10 
 b'DUP:RSRV: (GRP 5): ADDR_10 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_10 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_10;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_10) == 4), "reg_dup_rsvd_eng_addr_10 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_11 
 b'DUP:RSRV: (GRP 5): ADDR_11 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_11 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_11;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_11) == 4), "reg_dup_rsvd_eng_addr_11 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_12 
 b'DUP:RSRV: (GRP 5): ADDR_12 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_12 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_12;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_12) == 4), "reg_dup_rsvd_eng_addr_12 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_13 
 b'DUP:RSRV: (GRP 5): ADDR_13 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_13 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_13;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_13) == 4), "reg_dup_rsvd_eng_addr_13 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_14 
 b'DUP:RSRV: (GRP 5): ADDR_14 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_14 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_14;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_14) == 4), "reg_dup_rsvd_eng_addr_14 size is not 32-bit");
/*
 DUP_RSVD_ENG_ADDR_15 
 b'DUP:RSRV: (GRP 5): ADDR_15 Address'
*/
typedef struct reg_dup_rsvd_eng_addr_15 {
	union {
		struct {
			uint32_t val : 15,
				_reserved15 : 17;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_addr_15;
static_assert((sizeof(struct reg_dup_rsvd_eng_addr_15) == 4), "reg_dup_rsvd_eng_addr_15 size is not 32-bit");
/*
 DUP_TPC_ENG_MASK 
 b'DUP:TPC: (GRP0) Multi-cast mask'
*/
typedef struct reg_dup_tpc_eng_mask {
	union {
		struct {
			uint32_t val : 25,
				_reserved25 : 7;
		};
		uint32_t _raw;
	};
} reg_dup_tpc_eng_mask;
static_assert((sizeof(struct reg_dup_tpc_eng_mask) == 4), "reg_dup_tpc_eng_mask size is not 32-bit");
/*
 DUP_MME_ENG_MASK 
 b'DUP:MME: (GRP1) Multi-cast mask'
*/
typedef struct reg_dup_mme_eng_mask {
	union {
		struct {
			uint32_t val : 4,
				_reserved4 : 28;
		};
		uint32_t _raw;
	};
} reg_dup_mme_eng_mask;
static_assert((sizeof(struct reg_dup_mme_eng_mask) == 4), "reg_dup_mme_eng_mask size is not 32-bit");
/*
 DUP_EDMA_ENG_MASK 
 b'DUP:EDMA: (GRP2) Multi-cast mask'
*/
typedef struct reg_dup_edma_eng_mask {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_edma_eng_mask;
static_assert((sizeof(struct reg_dup_edma_eng_mask) == 4), "reg_dup_edma_eng_mask size is not 32-bit");
/*
 DUP_PDMA_ENG_MASK 
 b'DUP:PDMA: (GRP3) Multi-cast mask'
*/
typedef struct reg_dup_pdma_eng_mask {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_dup_pdma_eng_mask;
static_assert((sizeof(struct reg_dup_pdma_eng_mask) == 4), "reg_dup_pdma_eng_mask size is not 32-bit");
/*
 DUP_ROT_ENG_MASK 
 b'DUP:ROT: (GRP4) Multi-cast mask'
*/
typedef struct reg_dup_rot_eng_mask {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_dup_rot_eng_mask;
static_assert((sizeof(struct reg_dup_rot_eng_mask) == 4), "reg_dup_rot_eng_mask size is not 32-bit");
/*
 DUP_RSVD_ENG_MASK 
 b'DUP:RSRV: (GRP5) Multi-cast mask'
*/
typedef struct reg_dup_rsvd_eng_mask {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_rsvd_eng_mask;
static_assert((sizeof(struct reg_dup_rsvd_eng_mask) == 4), "reg_dup_rsvd_eng_mask size is not 32-bit");
/*
 DUP_NIC_ENG_MASK 
 b'DUP:NIC: (GRP6..13) Multi-cast mask (8xmasks)'
*/
typedef struct reg_dup_nic_eng_mask {
	union {
		struct {
			uint32_t val : 24,
				_reserved24 : 8;
		};
		uint32_t _raw;
	};
} reg_dup_nic_eng_mask;
static_assert((sizeof(struct reg_dup_nic_eng_mask) == 4), "reg_dup_nic_eng_mask size is not 32-bit");
/*
 DUP_TRANS_DATA_Q_0 
 b'DUP: DATA : Write to Queue 0 (14xQueues)'
*/
typedef struct reg_dup_trans_data_q_0 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_trans_data_q_0;
static_assert((sizeof(struct reg_dup_trans_data_q_0) == 4), "reg_dup_trans_data_q_0 size is not 32-bit");
/*
 DUP_TRANS_DATA_Q_1 
 b'DUP: DATA : Write to Queue-1 (Q0+4) (6xQueues)'
*/
typedef struct reg_dup_trans_data_q_1 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_trans_data_q_1;
static_assert((sizeof(struct reg_dup_trans_data_q_1) == 4), "reg_dup_trans_data_q_1 size is not 32-bit");
/*
 DUP_TRANS_DATA_Q_2 
 b'DUP: DATA : Write to Queue 2 (Q0+8) (6xQueues)'
*/
typedef struct reg_dup_trans_data_q_2 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_trans_data_q_2;
static_assert((sizeof(struct reg_dup_trans_data_q_2) == 4), "reg_dup_trans_data_q_2 size is not 32-bit");
/*
 DUP_TRANS_DATA_Q_3 
 b'DUP: DATA : Write to Queue 3 (Q0+12) (6xQueues)'
*/
typedef struct reg_dup_trans_data_q_3 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_trans_data_q_3;
static_assert((sizeof(struct reg_dup_trans_data_q_3) == 4), "reg_dup_trans_data_q_3 size is not 32-bit");
/*
 DUP_GENERAL_CFG 
 b'DUP: Configuration (Protection . Full-Threshold)'
*/
typedef struct reg_dup_general_cfg {
	union {
		struct {
			uint32_t axi_awprot : 3,
				_reserved15 : 12,
				fifo_full_th : 6,
				free_list_th : 9,
				_reserved30 : 2;
		};
		uint32_t _raw;
	};
} reg_dup_general_cfg;
static_assert((sizeof(struct reg_dup_general_cfg) == 4), "reg_dup_general_cfg size is not 32-bit");
/*
 DUP_BP_CFG 
 b'DUP: BP: Configuration (Stall/Discard)'
*/
typedef struct reg_dup_bp_cfg {
	union {
		struct {
			uint32_t dup_bp_trans_max_addr : 12,
				dup_bp_trans_min_addr : 12,
				dup_drop_apb_on_full : 1,
				_reserved25 : 7;
		};
		uint32_t _raw;
	};
} reg_dup_bp_cfg;
static_assert((sizeof(struct reg_dup_bp_cfg) == 4), "reg_dup_bp_cfg size is not 32-bit");
/*
 DUP_GRP_ENG_ADDR_OFFSET 
 b'DUP: Offset from Base-Address (For each group)'
*/
typedef struct reg_dup_grp_eng_addr_offset {
	union {
		struct {
			uint32_t val : 12,
				_reserved12 : 20;
		};
		uint32_t _raw;
	};
} reg_dup_grp_eng_addr_offset;
static_assert((sizeof(struct reg_dup_grp_eng_addr_offset) == 4), "reg_dup_grp_eng_addr_offset size is not 32-bit");
/*
 DUP_DBG_IN_GRP_TRANS 
 b'DUP: FA: Counter per each group'
*/
typedef struct reg_dup_dbg_in_grp_trans {
	union {
		struct {
			uint32_t grp_0 : 6,
				grp_1 : 6,
				grp_2 : 6,
				grp_3 : 6,
				grp_4 : 6,
				_reserved30 : 2;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_in_grp_trans;
static_assert((sizeof(struct reg_dup_dbg_in_grp_trans) == 4), "reg_dup_dbg_in_grp_trans size is not 32-bit");
/*
 DUP_DBG_STS 
 b'DUP: FA: Status (Discarded , FIFO-Occupancy , ..)'
*/
typedef struct reg_dup_dbg_sts {
	union {
		struct {
			uint32_t trans_fifo_occup : 6,
				num_in_flight_trans : 9,
				eng_dup_busy : 1,
				arc_trans_dropped : 1,
				otr_trans_dropped : 1,
				_reserved18 : 14;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_sts;
static_assert((sizeof(struct reg_dup_dbg_sts) == 4), "reg_dup_dbg_sts size is not 32-bit");
/*
 DUP_DBG_OUT_RQ_CNT 
 b'DUP: FA: Outstanding requests'
*/
typedef struct reg_dup_dbg_out_rq_cnt {
	union {
		struct {
			uint32_t val : 9,
				_reserved9 : 23;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_out_rq_cnt;
static_assert((sizeof(struct reg_dup_dbg_out_rq_cnt) == 4), "reg_dup_dbg_out_rq_cnt size is not 32-bit");
/*
 ARC_CONTEXT_ID 
 b'DUP: Atomic : 64xContexts'
*/
typedef struct reg_arc_context_id {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_arc_context_id;
static_assert((sizeof(struct reg_arc_context_id) == 4), "reg_arc_context_id size is not 32-bit");
/*
 ARC_CID_OFFSET 
 b'DUP: Atomic : Contexts offset to inc/dec'
*/
typedef struct reg_arc_cid_offset {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_arc_cid_offset;
static_assert((sizeof(struct reg_arc_cid_offset) == 4), "reg_arc_cid_offset size is not 32-bit");

#ifdef __cplusplus
} /* arc_dup_eng namespace */
#endif

/*
 ARC_DUP_ENG block
*/

#ifdef __cplusplus

struct block_arc_dup_eng {
	struct arc_dup_eng::reg_dup_tpc_eng_addr_0 dup_tpc_eng_addr_0;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_1 dup_tpc_eng_addr_1;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_2 dup_tpc_eng_addr_2;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_3 dup_tpc_eng_addr_3;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_4 dup_tpc_eng_addr_4;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_5 dup_tpc_eng_addr_5;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_6 dup_tpc_eng_addr_6;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_7 dup_tpc_eng_addr_7;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_8 dup_tpc_eng_addr_8;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_9 dup_tpc_eng_addr_9;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_10 dup_tpc_eng_addr_10;
	struct arc_dup_eng::reg_dup_tpc_eng_addr_11 dup_tpc_eng_addr_11;
