/***********************************
** This is an auto-generated file **
**       DO NOT EDIT BELOW        **
************************************/

#ifndef ASIC_REG_STRUCTS_GAUDI3_ARC_DUP_ENG_H_
#define ASIC_REG_STRUCTS_GAUDI3_ARC_DUP_ENG_H_

#include <stdint.h>
#include "gaudi3_types.h"
#include "special_regs_regs.h"

#pragma pack(push, 1)

#ifdef __cplusplus
namespace gaudi3 {
namespace arc_dup_eng {
#else
#	ifndef static_assert
#		if defined( __STDC__ ) && defined( __STDC_VERSION__ ) && __STDC_VERSION__ >= 201112L
#			define static_assert(...) _Static_assert(__VA_ARGS__)
#		else
#			define static_assert(...)
#		endif
#	endif
#endif

/*
 DUP_ADDR_GR_0 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_0 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_0;
static_assert((sizeof(struct reg_dup_addr_gr_0) == 4), "reg_dup_addr_gr_0 size is not 32-bit");
/*
 DUP_ADDR_GR_1 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_1 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_1;
static_assert((sizeof(struct reg_dup_addr_gr_1) == 4), "reg_dup_addr_gr_1 size is not 32-bit");
/*
 DUP_ADDR_GR_2 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_2 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_2;
static_assert((sizeof(struct reg_dup_addr_gr_2) == 4), "reg_dup_addr_gr_2 size is not 32-bit");
/*
 DUP_ADDR_GR_3 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_3 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_3;
static_assert((sizeof(struct reg_dup_addr_gr_3) == 4), "reg_dup_addr_gr_3 size is not 32-bit");
/*
 DUP_ADDR_GR_4 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_4 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_4;
static_assert((sizeof(struct reg_dup_addr_gr_4) == 4), "reg_dup_addr_gr_4 size is not 32-bit");
/*
 DUP_ADDR_GR_5 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_5 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_5;
static_assert((sizeof(struct reg_dup_addr_gr_5) == 4), "reg_dup_addr_gr_5 size is not 32-bit");
/*
 DUP_ADDR_GR_6 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_6 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_6;
static_assert((sizeof(struct reg_dup_addr_gr_6) == 4), "reg_dup_addr_gr_6 size is not 32-bit");
/*
 DUP_ADDR_GR_7 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_7 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_7;
static_assert((sizeof(struct reg_dup_addr_gr_7) == 4), "reg_dup_addr_gr_7 size is not 32-bit");
/*
 DUP_ADDR_GR_8 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_8 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_8;
static_assert((sizeof(struct reg_dup_addr_gr_8) == 4), "reg_dup_addr_gr_8 size is not 32-bit");
/*
 DUP_ADDR_GR_9 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_9 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_9;
static_assert((sizeof(struct reg_dup_addr_gr_9) == 4), "reg_dup_addr_gr_9 size is not 32-bit");
/*
 DUP_ADDR_GR_10 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_10 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_10;
static_assert((sizeof(struct reg_dup_addr_gr_10) == 4), "reg_dup_addr_gr_10 size is not 32-bit");
/*
 DUP_ADDR_GR_11 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_11 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_11;
static_assert((sizeof(struct reg_dup_addr_gr_11) == 4), "reg_dup_addr_gr_11 size is not 32-bit");
/*
 DUP_ADDR_GR_12 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_12 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_12;
static_assert((sizeof(struct reg_dup_addr_gr_12) == 4), "reg_dup_addr_gr_12 size is not 32-bit");
/*
 DUP_ADDR_GR_13 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_13 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_13;
static_assert((sizeof(struct reg_dup_addr_gr_13) == 4), "reg_dup_addr_gr_13 size is not 32-bit");
/*
 DUP_ADDR_GR_14 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_14 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_14;
static_assert((sizeof(struct reg_dup_addr_gr_14) == 4), "reg_dup_addr_gr_14 size is not 32-bit");
/*
 DUP_ADDR_GR_15 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_15 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_15;
static_assert((sizeof(struct reg_dup_addr_gr_15) == 4), "reg_dup_addr_gr_15 size is not 32-bit");
/*
 DUP_ADDR_GR_16 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_16 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_16;
static_assert((sizeof(struct reg_dup_addr_gr_16) == 4), "reg_dup_addr_gr_16 size is not 32-bit");
/*
 DUP_ADDR_GR_17 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_17 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_17;
static_assert((sizeof(struct reg_dup_addr_gr_17) == 4), "reg_dup_addr_gr_17 size is not 32-bit");
/*
 DUP_ADDR_GR_18 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_18 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_18;
static_assert((sizeof(struct reg_dup_addr_gr_18) == 4), "reg_dup_addr_gr_18 size is not 32-bit");
/*
 DUP_ADDR_GR_19 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_19 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_19;
static_assert((sizeof(struct reg_dup_addr_gr_19) == 4), "reg_dup_addr_gr_19 size is not 32-bit");
/*
 DUP_ADDR_GR_20 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_20 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_20;
static_assert((sizeof(struct reg_dup_addr_gr_20) == 4), "reg_dup_addr_gr_20 size is not 32-bit");
/*
 DUP_ADDR_GR_21 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_21 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_21;
static_assert((sizeof(struct reg_dup_addr_gr_21) == 4), "reg_dup_addr_gr_21 size is not 32-bit");
/*
 DUP_ADDR_GR_22 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_22 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_22;
static_assert((sizeof(struct reg_dup_addr_gr_22) == 4), "reg_dup_addr_gr_22 size is not 32-bit");
/*
 DUP_ADDR_GR_23 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_23 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_23;
static_assert((sizeof(struct reg_dup_addr_gr_23) == 4), "reg_dup_addr_gr_23 size is not 32-bit");
/*
 DUP_ADDR_GR_24 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_24 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_24;
static_assert((sizeof(struct reg_dup_addr_gr_24) == 4), "reg_dup_addr_gr_24 size is not 32-bit");
/*
 DUP_ADDR_GR_25 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_25 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_25;
static_assert((sizeof(struct reg_dup_addr_gr_25) == 4), "reg_dup_addr_gr_25 size is not 32-bit");
/*
 DUP_ADDR_GR_26 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_26 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_26;
static_assert((sizeof(struct reg_dup_addr_gr_26) == 4), "reg_dup_addr_gr_26 size is not 32-bit");
/*
 DUP_ADDR_GR_27 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_27 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_27;
static_assert((sizeof(struct reg_dup_addr_gr_27) == 4), "reg_dup_addr_gr_27 size is not 32-bit");
/*
 DUP_ADDR_GR_28 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_28 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_28;
static_assert((sizeof(struct reg_dup_addr_gr_28) == 4), "reg_dup_addr_gr_28 size is not 32-bit");
/*
 DUP_ADDR_GR_29 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_29 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_29;
static_assert((sizeof(struct reg_dup_addr_gr_29) == 4), "reg_dup_addr_gr_29 size is not 32-bit");
/*
 DUP_ADDR_GR_30 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_30 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_30;
static_assert((sizeof(struct reg_dup_addr_gr_30) == 4), "reg_dup_addr_gr_30 size is not 32-bit");
/*
 DUP_ADDR_GR_31 
 b'Engine address'
*/
typedef struct reg_dup_addr_gr_31 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_addr_gr_31;
static_assert((sizeof(struct reg_dup_addr_gr_31) == 4), "reg_dup_addr_gr_31 size is not 32-bit");
/*
 DUP_MASK_GR_0 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_0 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_0;
static_assert((sizeof(struct reg_dup_mask_gr_0) == 4), "reg_dup_mask_gr_0 size is not 32-bit");
/*
 DUP_MASK_GR_1 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_1 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_1;
static_assert((sizeof(struct reg_dup_mask_gr_1) == 4), "reg_dup_mask_gr_1 size is not 32-bit");
/*
 DUP_MASK_GR_2 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_2 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_2;
static_assert((sizeof(struct reg_dup_mask_gr_2) == 4), "reg_dup_mask_gr_2 size is not 32-bit");
/*
 DUP_MASK_GR_3 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_3 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_3;
static_assert((sizeof(struct reg_dup_mask_gr_3) == 4), "reg_dup_mask_gr_3 size is not 32-bit");
/*
 DUP_MASK_GR_4 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_4 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_4;
static_assert((sizeof(struct reg_dup_mask_gr_4) == 4), "reg_dup_mask_gr_4 size is not 32-bit");
/*
 DUP_MASK_GR_5 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_5 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_5;
static_assert((sizeof(struct reg_dup_mask_gr_5) == 4), "reg_dup_mask_gr_5 size is not 32-bit");
/*
 DUP_MASK_GR_6 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_6 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_6;
static_assert((sizeof(struct reg_dup_mask_gr_6) == 4), "reg_dup_mask_gr_6 size is not 32-bit");
/*
 DUP_MASK_GR_7 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_7 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_7;
static_assert((sizeof(struct reg_dup_mask_gr_7) == 4), "reg_dup_mask_gr_7 size is not 32-bit");
/*
 DUP_MASK_GR_8 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_8 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_8;
static_assert((sizeof(struct reg_dup_mask_gr_8) == 4), "reg_dup_mask_gr_8 size is not 32-bit");
/*
 DUP_MASK_GR_9 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_9 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_9;
static_assert((sizeof(struct reg_dup_mask_gr_9) == 4), "reg_dup_mask_gr_9 size is not 32-bit");
/*
 DUP_MASK_GR_10 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_10 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_10;
static_assert((sizeof(struct reg_dup_mask_gr_10) == 4), "reg_dup_mask_gr_10 size is not 32-bit");
/*
 DUP_MASK_GR_11 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_11 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_11;
static_assert((sizeof(struct reg_dup_mask_gr_11) == 4), "reg_dup_mask_gr_11 size is not 32-bit");
/*
 DUP_MASK_GR_12 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_12 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_12;
static_assert((sizeof(struct reg_dup_mask_gr_12) == 4), "reg_dup_mask_gr_12 size is not 32-bit");
/*
 DUP_MASK_GR_13 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_13 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_13;
static_assert((sizeof(struct reg_dup_mask_gr_13) == 4), "reg_dup_mask_gr_13 size is not 32-bit");
/*
 DUP_MASK_GR_14 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_14 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_14;
static_assert((sizeof(struct reg_dup_mask_gr_14) == 4), "reg_dup_mask_gr_14 size is not 32-bit");
/*
 DUP_MASK_GR_15 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_15 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_15;
static_assert((sizeof(struct reg_dup_mask_gr_15) == 4), "reg_dup_mask_gr_15 size is not 32-bit");
/*
 DUP_MASK_GR_16 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_16 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_16;
static_assert((sizeof(struct reg_dup_mask_gr_16) == 4), "reg_dup_mask_gr_16 size is not 32-bit");
/*
 DUP_MASK_GR_17 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_17 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_17;
static_assert((sizeof(struct reg_dup_mask_gr_17) == 4), "reg_dup_mask_gr_17 size is not 32-bit");
/*
 DUP_MASK_GR_18 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_18 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_18;
static_assert((sizeof(struct reg_dup_mask_gr_18) == 4), "reg_dup_mask_gr_18 size is not 32-bit");
/*
 DUP_MASK_GR_19 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_19 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_19;
static_assert((sizeof(struct reg_dup_mask_gr_19) == 4), "reg_dup_mask_gr_19 size is not 32-bit");
/*
 DUP_MASK_GR_20 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_20 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_20;
static_assert((sizeof(struct reg_dup_mask_gr_20) == 4), "reg_dup_mask_gr_20 size is not 32-bit");
/*
 DUP_MASK_GR_21 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_21 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_21;
static_assert((sizeof(struct reg_dup_mask_gr_21) == 4), "reg_dup_mask_gr_21 size is not 32-bit");
/*
 DUP_MASK_GR_22 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_22 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_22;
static_assert((sizeof(struct reg_dup_mask_gr_22) == 4), "reg_dup_mask_gr_22 size is not 32-bit");
/*
 DUP_MASK_GR_23 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_23 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_23;
static_assert((sizeof(struct reg_dup_mask_gr_23) == 4), "reg_dup_mask_gr_23 size is not 32-bit");
/*
 DUP_MASK_GR_24 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_24 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_24;
static_assert((sizeof(struct reg_dup_mask_gr_24) == 4), "reg_dup_mask_gr_24 size is not 32-bit");
/*
 DUP_MASK_GR_25 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_25 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_25;
static_assert((sizeof(struct reg_dup_mask_gr_25) == 4), "reg_dup_mask_gr_25 size is not 32-bit");
/*
 DUP_MASK_GR_26 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_26 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_26;
static_assert((sizeof(struct reg_dup_mask_gr_26) == 4), "reg_dup_mask_gr_26 size is not 32-bit");
/*
 DUP_MASK_GR_27 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_27 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_27;
static_assert((sizeof(struct reg_dup_mask_gr_27) == 4), "reg_dup_mask_gr_27 size is not 32-bit");
/*
 DUP_MASK_GR_28 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_28 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_28;
static_assert((sizeof(struct reg_dup_mask_gr_28) == 4), "reg_dup_mask_gr_28 size is not 32-bit");
/*
 DUP_MASK_GR_29 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_29 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_29;
static_assert((sizeof(struct reg_dup_mask_gr_29) == 4), "reg_dup_mask_gr_29 size is not 32-bit");
/*
 DUP_MASK_GR_30 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_30 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_30;
static_assert((sizeof(struct reg_dup_mask_gr_30) == 4), "reg_dup_mask_gr_30 size is not 32-bit");
/*
 DUP_MASK_GR_31 
 b'Msk - which eng should get broadcast'
*/
typedef struct reg_dup_mask_gr_31 {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_mask_gr_31;
static_assert((sizeof(struct reg_dup_mask_gr_31) == 4), "reg_dup_mask_gr_31 size is not 32-bit");
/*
 DUP_OFFSET_GR_0 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_0 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_0;
static_assert((sizeof(struct reg_dup_offset_gr_0) == 4), "reg_dup_offset_gr_0 size is not 32-bit");
/*
 DUP_OFFSET_GR_1 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_1 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_1;
static_assert((sizeof(struct reg_dup_offset_gr_1) == 4), "reg_dup_offset_gr_1 size is not 32-bit");
/*
 DUP_OFFSET_GR_2 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_2 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_2;
static_assert((sizeof(struct reg_dup_offset_gr_2) == 4), "reg_dup_offset_gr_2 size is not 32-bit");
/*
 DUP_OFFSET_GR_3 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_3 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_3;
static_assert((sizeof(struct reg_dup_offset_gr_3) == 4), "reg_dup_offset_gr_3 size is not 32-bit");
/*
 DUP_OFFSET_GR_4 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_4 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_4;
static_assert((sizeof(struct reg_dup_offset_gr_4) == 4), "reg_dup_offset_gr_4 size is not 32-bit");
/*
 DUP_OFFSET_GR_5 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_5 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_5;
static_assert((sizeof(struct reg_dup_offset_gr_5) == 4), "reg_dup_offset_gr_5 size is not 32-bit");
/*
 DUP_OFFSET_GR_6 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_6 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_6;
static_assert((sizeof(struct reg_dup_offset_gr_6) == 4), "reg_dup_offset_gr_6 size is not 32-bit");
/*
 DUP_OFFSET_GR_7 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_7 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_7;
static_assert((sizeof(struct reg_dup_offset_gr_7) == 4), "reg_dup_offset_gr_7 size is not 32-bit");
/*
 DUP_OFFSET_GR_8 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_8 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_8;
static_assert((sizeof(struct reg_dup_offset_gr_8) == 4), "reg_dup_offset_gr_8 size is not 32-bit");
/*
 DUP_OFFSET_GR_9 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_9 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_9;
static_assert((sizeof(struct reg_dup_offset_gr_9) == 4), "reg_dup_offset_gr_9 size is not 32-bit");
/*
 DUP_OFFSET_GR_10 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_10 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_10;
static_assert((sizeof(struct reg_dup_offset_gr_10) == 4), "reg_dup_offset_gr_10 size is not 32-bit");
/*
 DUP_OFFSET_GR_11 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_11 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_11;
static_assert((sizeof(struct reg_dup_offset_gr_11) == 4), "reg_dup_offset_gr_11 size is not 32-bit");
/*
 DUP_OFFSET_GR_12 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_12 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_12;
static_assert((sizeof(struct reg_dup_offset_gr_12) == 4), "reg_dup_offset_gr_12 size is not 32-bit");
/*
 DUP_OFFSET_GR_13 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_13 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_13;
static_assert((sizeof(struct reg_dup_offset_gr_13) == 4), "reg_dup_offset_gr_13 size is not 32-bit");
/*
 DUP_OFFSET_GR_14 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_14 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_14;
static_assert((sizeof(struct reg_dup_offset_gr_14) == 4), "reg_dup_offset_gr_14 size is not 32-bit");
/*
 DUP_OFFSET_GR_15 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_15 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_15;
static_assert((sizeof(struct reg_dup_offset_gr_15) == 4), "reg_dup_offset_gr_15 size is not 32-bit");
/*
 DUP_OFFSET_GR_16 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_16 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_16;
static_assert((sizeof(struct reg_dup_offset_gr_16) == 4), "reg_dup_offset_gr_16 size is not 32-bit");
/*
 DUP_OFFSET_GR_17 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_17 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_17;
static_assert((sizeof(struct reg_dup_offset_gr_17) == 4), "reg_dup_offset_gr_17 size is not 32-bit");
/*
 DUP_OFFSET_GR_18 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_18 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_18;
static_assert((sizeof(struct reg_dup_offset_gr_18) == 4), "reg_dup_offset_gr_18 size is not 32-bit");
/*
 DUP_OFFSET_GR_19 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_19 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_19;
static_assert((sizeof(struct reg_dup_offset_gr_19) == 4), "reg_dup_offset_gr_19 size is not 32-bit");
/*
 DUP_OFFSET_GR_20 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_20 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_20;
static_assert((sizeof(struct reg_dup_offset_gr_20) == 4), "reg_dup_offset_gr_20 size is not 32-bit");
/*
 DUP_OFFSET_GR_21 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_21 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_21;
static_assert((sizeof(struct reg_dup_offset_gr_21) == 4), "reg_dup_offset_gr_21 size is not 32-bit");
/*
 DUP_OFFSET_GR_22 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_22 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_22;
static_assert((sizeof(struct reg_dup_offset_gr_22) == 4), "reg_dup_offset_gr_22 size is not 32-bit");
/*
 DUP_OFFSET_GR_23 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_23 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_23;
static_assert((sizeof(struct reg_dup_offset_gr_23) == 4), "reg_dup_offset_gr_23 size is not 32-bit");
/*
 DUP_OFFSET_GR_24 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_24 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_24;
static_assert((sizeof(struct reg_dup_offset_gr_24) == 4), "reg_dup_offset_gr_24 size is not 32-bit");
/*
 DUP_OFFSET_GR_25 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_25 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_25;
static_assert((sizeof(struct reg_dup_offset_gr_25) == 4), "reg_dup_offset_gr_25 size is not 32-bit");
/*
 DUP_OFFSET_GR_26 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_26 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_26;
static_assert((sizeof(struct reg_dup_offset_gr_26) == 4), "reg_dup_offset_gr_26 size is not 32-bit");
/*
 DUP_OFFSET_GR_27 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_27 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_27;
static_assert((sizeof(struct reg_dup_offset_gr_27) == 4), "reg_dup_offset_gr_27 size is not 32-bit");
/*
 DUP_OFFSET_GR_28 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_28 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_28;
static_assert((sizeof(struct reg_dup_offset_gr_28) == 4), "reg_dup_offset_gr_28 size is not 32-bit");
/*
 DUP_OFFSET_GR_29 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_29 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_29;
static_assert((sizeof(struct reg_dup_offset_gr_29) == 4), "reg_dup_offset_gr_29 size is not 32-bit");
/*
 DUP_OFFSET_GR_30 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_30 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_30;
static_assert((sizeof(struct reg_dup_offset_gr_30) == 4), "reg_dup_offset_gr_30 size is not 32-bit");
/*
 DUP_OFFSET_GR_31 
 b'Offset - which eng should get broadcast'
*/
typedef struct reg_dup_offset_gr_31 {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_offset_gr_31;
static_assert((sizeof(struct reg_dup_offset_gr_31) == 4), "reg_dup_offset_gr_31 size is not 32-bit");
/*
 DUP_UC_GR_0 
 b'DUP Unicast Mode Group 0'
*/
typedef struct reg_dup_uc_gr_0 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_0;
static_assert((sizeof(struct reg_dup_uc_gr_0) == 4), "reg_dup_uc_gr_0 size is not 32-bit");
/*
 DUP_UC_GR_1 
 b'DUP Unicast Mode Group 1'
*/
typedef struct reg_dup_uc_gr_1 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_1;
static_assert((sizeof(struct reg_dup_uc_gr_1) == 4), "reg_dup_uc_gr_1 size is not 32-bit");
/*
 DUP_UC_GR_2 
 b'DUP Unicast Mode Group 2'
*/
typedef struct reg_dup_uc_gr_2 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_2;
static_assert((sizeof(struct reg_dup_uc_gr_2) == 4), "reg_dup_uc_gr_2 size is not 32-bit");
/*
 DUP_UC_GR_3 
 b'DUP Unicast Mode Group 3'
*/
typedef struct reg_dup_uc_gr_3 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_3;
static_assert((sizeof(struct reg_dup_uc_gr_3) == 4), "reg_dup_uc_gr_3 size is not 32-bit");
/*
 DUP_UC_GR_4 
 b'DUP Unicast Mode Group 4'
*/
typedef struct reg_dup_uc_gr_4 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_4;
static_assert((sizeof(struct reg_dup_uc_gr_4) == 4), "reg_dup_uc_gr_4 size is not 32-bit");
/*
 DUP_UC_GR_5 
 b'DUP Unicast Mode Group 5'
*/
typedef struct reg_dup_uc_gr_5 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_5;
static_assert((sizeof(struct reg_dup_uc_gr_5) == 4), "reg_dup_uc_gr_5 size is not 32-bit");
/*
 DUP_UC_GR_6 
 b'DUP Unicast Mode Group 6'
*/
typedef struct reg_dup_uc_gr_6 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_6;
static_assert((sizeof(struct reg_dup_uc_gr_6) == 4), "reg_dup_uc_gr_6 size is not 32-bit");
/*
 DUP_UC_GR_7 
 b'DUP Unicast Mode Group 7'
*/
typedef struct reg_dup_uc_gr_7 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_7;
static_assert((sizeof(struct reg_dup_uc_gr_7) == 4), "reg_dup_uc_gr_7 size is not 32-bit");
/*
 DUP_UC_GR_8 
 b'DUP Unicast Mode Group 8'
*/
typedef struct reg_dup_uc_gr_8 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_8;
static_assert((sizeof(struct reg_dup_uc_gr_8) == 4), "reg_dup_uc_gr_8 size is not 32-bit");
/*
 DUP_UC_GR_9 
 b'DUP Unicast Mode Group 9'
*/
typedef struct reg_dup_uc_gr_9 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_9;
static_assert((sizeof(struct reg_dup_uc_gr_9) == 4), "reg_dup_uc_gr_9 size is not 32-bit");
/*
 DUP_UC_GR_10 
 b'DUP Unicast Mode Group 10'
*/
typedef struct reg_dup_uc_gr_10 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_10;
static_assert((sizeof(struct reg_dup_uc_gr_10) == 4), "reg_dup_uc_gr_10 size is not 32-bit");
/*
 DUP_UC_GR_11 
 b'DUP Unicast Mode Group 11'
*/
typedef struct reg_dup_uc_gr_11 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_11;
static_assert((sizeof(struct reg_dup_uc_gr_11) == 4), "reg_dup_uc_gr_11 size is not 32-bit");
/*
 DUP_UC_GR_12 
 b'DUP Unicast Mode Group 12'
*/
typedef struct reg_dup_uc_gr_12 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_12;
static_assert((sizeof(struct reg_dup_uc_gr_12) == 4), "reg_dup_uc_gr_12 size is not 32-bit");
/*
 DUP_UC_GR_13 
 b'DUP Unicast Mode Group 13'
*/
typedef struct reg_dup_uc_gr_13 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_13;
static_assert((sizeof(struct reg_dup_uc_gr_13) == 4), "reg_dup_uc_gr_13 size is not 32-bit");
/*
 DUP_UC_GR_14 
 b'DUP Unicast Mode Group 14'
*/
typedef struct reg_dup_uc_gr_14 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_14;
static_assert((sizeof(struct reg_dup_uc_gr_14) == 4), "reg_dup_uc_gr_14 size is not 32-bit");
/*
 DUP_UC_GR_15 
 b'DUP Unicast Mode Group 15'
*/
typedef struct reg_dup_uc_gr_15 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_15;
static_assert((sizeof(struct reg_dup_uc_gr_15) == 4), "reg_dup_uc_gr_15 size is not 32-bit");
/*
 DUP_UC_GR_16 
 b'DUP Unicast Mode Group 16'
*/
typedef struct reg_dup_uc_gr_16 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_16;
static_assert((sizeof(struct reg_dup_uc_gr_16) == 4), "reg_dup_uc_gr_16 size is not 32-bit");
/*
 DUP_UC_GR_17 
 b'DUP Unicast Mode Group 17'
*/
typedef struct reg_dup_uc_gr_17 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_17;
static_assert((sizeof(struct reg_dup_uc_gr_17) == 4), "reg_dup_uc_gr_17 size is not 32-bit");
/*
 DUP_UC_GR_18 
 b'DUP Unicast Mode Group 18'
*/
typedef struct reg_dup_uc_gr_18 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_18;
static_assert((sizeof(struct reg_dup_uc_gr_18) == 4), "reg_dup_uc_gr_18 size is not 32-bit");
/*
 DUP_UC_GR_19 
 b'DUP Unicast Mode Group 19'
*/
typedef struct reg_dup_uc_gr_19 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_19;
static_assert((sizeof(struct reg_dup_uc_gr_19) == 4), "reg_dup_uc_gr_19 size is not 32-bit");
/*
 DUP_UC_GR_20 
 b'DUP Unicast Mode Group 20'
*/
typedef struct reg_dup_uc_gr_20 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_20;
static_assert((sizeof(struct reg_dup_uc_gr_20) == 4), "reg_dup_uc_gr_20 size is not 32-bit");
/*
 DUP_UC_GR_21 
 b'DUP Unicast Mode Group 21'
*/
typedef struct reg_dup_uc_gr_21 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_21;
static_assert((sizeof(struct reg_dup_uc_gr_21) == 4), "reg_dup_uc_gr_21 size is not 32-bit");
/*
 DUP_UC_GR_22 
 b'DUP Unicast Mode Group 22'
*/
typedef struct reg_dup_uc_gr_22 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_22;
static_assert((sizeof(struct reg_dup_uc_gr_22) == 4), "reg_dup_uc_gr_22 size is not 32-bit");
/*
 DUP_UC_GR_23 
 b'DUP Unicast Mode Group 23'
*/
typedef struct reg_dup_uc_gr_23 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_23;
static_assert((sizeof(struct reg_dup_uc_gr_23) == 4), "reg_dup_uc_gr_23 size is not 32-bit");
/*
 DUP_UC_GR_24 
 b'DUP Unicast Mode Group 24'
*/
typedef struct reg_dup_uc_gr_24 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_24;
static_assert((sizeof(struct reg_dup_uc_gr_24) == 4), "reg_dup_uc_gr_24 size is not 32-bit");
/*
 DUP_UC_GR_25 
 b'DUP Unicast Mode Group 25'
*/
typedef struct reg_dup_uc_gr_25 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_25;
static_assert((sizeof(struct reg_dup_uc_gr_25) == 4), "reg_dup_uc_gr_25 size is not 32-bit");
/*
 DUP_UC_GR_26 
 b'DUP Unicast Mode Group 26'
*/
typedef struct reg_dup_uc_gr_26 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_26;
static_assert((sizeof(struct reg_dup_uc_gr_26) == 4), "reg_dup_uc_gr_26 size is not 32-bit");
/*
 DUP_UC_GR_27 
 b'DUP Unicast Mode Group 27'
*/
typedef struct reg_dup_uc_gr_27 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_27;
static_assert((sizeof(struct reg_dup_uc_gr_27) == 4), "reg_dup_uc_gr_27 size is not 32-bit");
/*
 DUP_UC_GR_28 
 b'DUP Unicast Mode Group 28'
*/
typedef struct reg_dup_uc_gr_28 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_28;
static_assert((sizeof(struct reg_dup_uc_gr_28) == 4), "reg_dup_uc_gr_28 size is not 32-bit");
/*
 DUP_UC_GR_29 
 b'DUP Unicast Mode Group 29'
*/
typedef struct reg_dup_uc_gr_29 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_29;
static_assert((sizeof(struct reg_dup_uc_gr_29) == 4), "reg_dup_uc_gr_29 size is not 32-bit");
/*
 DUP_UC_GR_30 
 b'DUP Unicast Mode Group 30'
*/
typedef struct reg_dup_uc_gr_30 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_30;
static_assert((sizeof(struct reg_dup_uc_gr_30) == 4), "reg_dup_uc_gr_30 size is not 32-bit");
/*
 DUP_UC_GR_31 
 b'DUP Unicast Mode Group 31'
*/
typedef struct reg_dup_uc_gr_31 {
	union {
		struct {
			uint32_t addr : 29,
				_reserved31 : 2,
				en : 1;
		};
		uint32_t _raw;
	};
} reg_dup_uc_gr_31;
static_assert((sizeof(struct reg_dup_uc_gr_31) == 4), "reg_dup_uc_gr_31 size is not 32-bit");
/*
 DUP_CONTROL_HALT 
 b'DUP Control'
*/
typedef struct reg_dup_control_halt {
	union {
		struct {
			uint32_t val : 1,
				_reserved1 : 31;
		};
		uint32_t _raw;
	};
} reg_dup_control_halt;
static_assert((sizeof(struct reg_dup_control_halt) == 4), "reg_dup_control_halt size is not 32-bit");
/*
 DUP_CONTROL_MODE 
 b'DUP Control'
*/
typedef struct reg_dup_control_mode {
	union {
		struct {
			uint32_t mc_mode : 1,
				_reserved4 : 3,
				ovf_mode : 1,
				_reserved5 : 27;
		};
		uint32_t _raw;
	};
} reg_dup_control_mode;
static_assert((sizeof(struct reg_dup_control_mode) == 4), "reg_dup_control_mode size is not 32-bit");
/*
 DUP_CONFIG 
 b'DUP Config'
*/
typedef struct reg_dup_config {
	union {
		struct {
			uint32_t grp_num : 8,
				addr_num : 8,
				fifo_size : 8,
				_reserved24 : 8;
		};
		uint32_t _raw;
	};
} reg_dup_config;
static_assert((sizeof(struct reg_dup_config) == 4), "reg_dup_config size is not 32-bit");
/*
 DUP_INFLIGHT_LIMIT 
 b'DUP Inflight Limit Value'
*/
typedef struct reg_dup_inflight_limit {
	union {
		struct {
			uint32_t val : 10,
				_reserved10 : 22;
		};
		uint32_t _raw;
	};
} reg_dup_inflight_limit;
static_assert((sizeof(struct reg_dup_inflight_limit) == 4), "reg_dup_inflight_limit size is not 32-bit");
/*
 DUP_STATUS 
 b'DUP Status'
*/
typedef struct reg_dup_status {
	union {
		struct {
			uint32_t dup_inflight : 10,
				_reserved16 : 6,
				fifo_fullness : 10,
				_reserved31 : 5,
				busy : 1;
		};
		uint32_t _raw;
	};
} reg_dup_status;
static_assert((sizeof(struct reg_dup_status) == 4), "reg_dup_status size is not 32-bit");
/*
 DUP_FIFO_FULL_TH 
 b'DUP FIFO Full Threshold'
*/
typedef struct reg_dup_fifo_full_th {
	union {
		struct {
			uint32_t val : 11,
				_reserved11 : 21;
		};
		uint32_t _raw;
	};
} reg_dup_fifo_full_th;
static_assert((sizeof(struct reg_dup_fifo_full_th) == 4), "reg_dup_fifo_full_th size is not 32-bit");
/*
 DUP_BUSER_RESPONSE 
 b'DUP BUSER Response Value'
*/
typedef struct reg_dup_buser_response {
	union {
		struct {
			uint32_t push : 8,
				eng_cfg : 8,
				noc_cfg : 8,
				_reserved24 : 8;
		};
		uint32_t _raw;
	};
} reg_dup_buser_response;
static_assert((sizeof(struct reg_dup_buser_response) == 4), "reg_dup_buser_response size is not 32-bit");
/*
 DUP_SEI_INTR_STS 
 b'DUP SEI Interrupt Status'
*/
typedef struct reg_dup_sei_intr_sts {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_sei_intr_sts;
static_assert((sizeof(struct reg_dup_sei_intr_sts) == 4), "reg_dup_sei_intr_sts size is not 32-bit");
/*
 DUP_SEI_INTR_CLR 
 b'DUP SEI Interrupt Clear'
*/
typedef struct reg_dup_sei_intr_clr {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_sei_intr_clr;
static_assert((sizeof(struct reg_dup_sei_intr_clr) == 4), "reg_dup_sei_intr_clr size is not 32-bit");
/*
 DUP_SEI_INTR_MASK 
 b'DUP SEI Interrupt Mask'
*/
typedef struct reg_dup_sei_intr_mask {
	union {
		struct {
			uint32_t val : 8,
				_reserved8 : 24;
		};
		uint32_t _raw;
	};
} reg_dup_sei_intr_mask;
static_assert((sizeof(struct reg_dup_sei_intr_mask) == 4), "reg_dup_sei_intr_mask size is not 32-bit");
/*
 DUP_PUSH_MIN_ADDR 
 b'DUP PUSH MIN Address'
*/
typedef struct reg_dup_push_min_addr {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_push_min_addr;
static_assert((sizeof(struct reg_dup_push_min_addr) == 4), "reg_dup_push_min_addr size is not 32-bit");
/*
 DUP_PUSH_MAX_ADDR 
 b'DUP PUSH MAX Address'
*/
typedef struct reg_dup_push_max_addr {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_push_max_addr;
static_assert((sizeof(struct reg_dup_push_max_addr) == 4), "reg_dup_push_max_addr size is not 32-bit");
/*
 DUP_CFG_MIN_ADDR 
 b'DUP CFG MIN Address'
*/
typedef struct reg_dup_cfg_min_addr {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_cfg_min_addr;
static_assert((sizeof(struct reg_dup_cfg_min_addr) == 4), "reg_dup_cfg_min_addr size is not 32-bit");
/*
 DUP_CFG_MAX_ADDR 
 b'DUP CFG MAX Address'
*/
typedef struct reg_dup_cfg_max_addr {
	union {
		struct {
			uint32_t val : 16,
				_reserved16 : 16;
		};
		uint32_t _raw;
	};
} reg_dup_cfg_max_addr;
static_assert((sizeof(struct reg_dup_cfg_max_addr) == 4), "reg_dup_cfg_max_addr size is not 32-bit");
/*
 DUP_PUSH_BLOCK_DUP_CFG_EN 
 b'DUP PUSH Access for blocking CFG access EN'
*/
typedef struct reg_dup_push_block_dup_cfg_en {
	union {
		struct {
			uint32_t val : 1,
				_reserved1 : 31;
		};
		uint32_t _raw;
	};
} reg_dup_push_block_dup_cfg_en;
static_assert((sizeof(struct reg_dup_push_block_dup_cfg_en) == 4), "reg_dup_push_block_dup_cfg_en size is not 32-bit");
/*
 DUP_CFG_BLOCK_DUP_PUSH_EN 
 b'DUP CFG Access for blocking PUSH access EN'
*/
typedef struct reg_dup_cfg_block_dup_push_en {
	union {
		struct {
			uint32_t val : 1,
				_reserved1 : 31;
		};
		uint32_t _raw;
	};
} reg_dup_cfg_block_dup_push_en;
static_assert((sizeof(struct reg_dup_cfg_block_dup_push_en) == 4), "reg_dup_cfg_block_dup_push_en size is not 32-bit");
/*
 ENG2DUP_FORK_WIN_EN 
 b'ENG2DUP FORK Window Enable'
*/
typedef struct reg_eng2dup_fork_win_en {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_win_en;
static_assert((sizeof(struct reg_eng2dup_fork_win_en) == 4), "reg_eng2dup_fork_win_en size is not 32-bit");
/*
 ENG2DUP_FORK_MIN_ADDR0 
 b'ENG2DUP FORK MIN ADDR0'
*/
typedef struct reg_eng2dup_fork_min_addr0 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_min_addr0;
static_assert((sizeof(struct reg_eng2dup_fork_min_addr0) == 4), "reg_eng2dup_fork_min_addr0 size is not 32-bit");
/*
 ENG2DUP_FORK_MAX_ADDR0 
 b'ENG2DUP FORK MAX ADDR0'
*/
typedef struct reg_eng2dup_fork_max_addr0 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_max_addr0;
static_assert((sizeof(struct reg_eng2dup_fork_max_addr0) == 4), "reg_eng2dup_fork_max_addr0 size is not 32-bit");
/*
 ENG2DUP_FORK_MASK_ADDR0 
 b'ENG2DUP FORK MASK ADDR0'
*/
typedef struct reg_eng2dup_fork_mask_addr0 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_mask_addr0;
static_assert((sizeof(struct reg_eng2dup_fork_mask_addr0) == 4), "reg_eng2dup_fork_mask_addr0 size is not 32-bit");
/*
 ENG2DUP_FORK_MIN_ADDR1 
 b'ENG2DUP FORK MIN ADDR1'
*/
typedef struct reg_eng2dup_fork_min_addr1 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_min_addr1;
static_assert((sizeof(struct reg_eng2dup_fork_min_addr1) == 4), "reg_eng2dup_fork_min_addr1 size is not 32-bit");
/*
 ENG2DUP_FORK_MAX_ADDR1 
 b'ENG2DUP FORK MAX ADDR1'
*/
typedef struct reg_eng2dup_fork_max_addr1 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_max_addr1;
static_assert((sizeof(struct reg_eng2dup_fork_max_addr1) == 4), "reg_eng2dup_fork_max_addr1 size is not 32-bit");
/*
 ENG2DUP_FORK_MASK_ADDR1 
 b'ENG2DUP FORK MASK ADDR1'
*/
typedef struct reg_eng2dup_fork_mask_addr1 {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_mask_addr1;
static_assert((sizeof(struct reg_eng2dup_fork_mask_addr1) == 4), "reg_eng2dup_fork_mask_addr1 size is not 32-bit");
/*
 ENG2DUP_FORK_TERMINATE_BRESP 
 b'ENG2DUP FORK Terminate BRESP Value'
*/
typedef struct reg_eng2dup_fork_terminate_bresp {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_terminate_bresp;
static_assert((sizeof(struct reg_eng2dup_fork_terminate_bresp) == 4), "reg_eng2dup_fork_terminate_bresp size is not 32-bit");
/*
 ENG2DUP_FORK_TERMINATE_RRESP 
 b'ENG2DUP FORK Terminate RRESP Value'
*/
typedef struct reg_eng2dup_fork_terminate_rresp {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_terminate_rresp;
static_assert((sizeof(struct reg_eng2dup_fork_terminate_rresp) == 4), "reg_eng2dup_fork_terminate_rresp size is not 32-bit");
/*
 ENG2DUP_FORK_ARADDR_INTR_INFO 
 b'ENG2DUP FORK ARADDR INTR INFO'
*/
typedef struct reg_eng2dup_fork_araddr_intr_info {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_araddr_intr_info;
static_assert((sizeof(struct reg_eng2dup_fork_araddr_intr_info) == 4), "reg_eng2dup_fork_araddr_intr_info size is not 32-bit");
/*
 ENG2DUP_FORK_AWADDR_INTR_INFO 
 b'ENG2DUP FORK AWADDR INTR INFO'
*/
typedef struct reg_eng2dup_fork_awaddr_intr_info {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_eng2dup_fork_awaddr_intr_info;
static_assert((sizeof(struct reg_eng2dup_fork_awaddr_intr_info) == 4), "reg_eng2dup_fork_awaddr_intr_info size is not 32-bit");
/*
 DUP_AXI2APB_CFG 
 b'DUP AXI2APB CFG'
*/
typedef struct reg_dup_axi2apb_cfg {
	union {
		struct {
			uint32_t mask_err_rsp : 1,
				_reserved4 : 3,
				blk_partial_strb : 1,
				_reserved8 : 3,
				spl_err_rsp : 1,
				_reserved9 : 23;
		};
		uint32_t _raw;
	};
} reg_dup_axi2apb_cfg;
static_assert((sizeof(struct reg_dup_axi2apb_cfg) == 4), "reg_dup_axi2apb_cfg size is not 32-bit");
/*
 DUP_APB_FORK_MAX_ADDR0 
 b'DUP APB FORK Max ADDR0'
*/
typedef struct reg_dup_apb_fork_max_addr0 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_apb_fork_max_addr0;
static_assert((sizeof(struct reg_dup_apb_fork_max_addr0) == 4), "reg_dup_apb_fork_max_addr0 size is not 32-bit");
/*
 DUP_APB_FORK_MAX_ADDR1 
 b'DUP APB FORK Max ADDR1'
*/
typedef struct reg_dup_apb_fork_max_addr1 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_apb_fork_max_addr1;
static_assert((sizeof(struct reg_dup_apb_fork_max_addr1) == 4), "reg_dup_apb_fork_max_addr1 size is not 32-bit");
/*
 DUP_APB_FORK_MAX_ADDR2 
 b'DUP APB FORK Max ADDR2'
*/
typedef struct reg_dup_apb_fork_max_addr2 {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_apb_fork_max_addr2;
static_assert((sizeof(struct reg_dup_apb_fork_max_addr2) == 4), "reg_dup_apb_fork_max_addr2 size is not 32-bit");
/*
 DUP_PUSH_TERMINATOR_BRESP 
 b'DUP PUSH TERMINATOR BRESP Value'
*/
typedef struct reg_dup_push_terminator_bresp {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_dup_push_terminator_bresp;
static_assert((sizeof(struct reg_dup_push_terminator_bresp) == 4), "reg_dup_push_terminator_bresp size is not 32-bit");
/*
 DUP_PUSH_TERMINATOR_RRESP 
 b'DUP PUSH TERMINATOR RRESP Value'
*/
typedef struct reg_dup_push_terminator_rresp {
	union {
		struct {
			uint32_t val : 2,
				_reserved2 : 30;
		};
		uint32_t _raw;
	};
} reg_dup_push_terminator_rresp;
static_assert((sizeof(struct reg_dup_push_terminator_rresp) == 4), "reg_dup_push_terminator_rresp size is not 32-bit");
/*
 DUP_DBG_LAST_GRP 
 b'DUP DBG LAST GRP'
*/
typedef struct reg_dup_dbg_last_grp {
	union {
		struct {
			uint32_t val : 5,
				_reserved5 : 27;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_last_grp;
static_assert((sizeof(struct reg_dup_dbg_last_grp) == 4), "reg_dup_dbg_last_grp size is not 32-bit");
/*
 DUP_DBG_LAST_WDATA 
 b'DUP DBG LAST WDATA'
*/
typedef struct reg_dup_dbg_last_wdata {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_last_wdata;
static_assert((sizeof(struct reg_dup_dbg_last_wdata) == 4), "reg_dup_dbg_last_wdata size is not 32-bit");
/*
 DUP_DBG_LAST_AWADDR 
 b'DUP DBG LAST AWADDR'
*/
typedef struct reg_dup_dbg_last_awaddr {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_last_awaddr;
static_assert((sizeof(struct reg_dup_dbg_last_awaddr) == 4), "reg_dup_dbg_last_awaddr size is not 32-bit");
/*
 DUP_DBG_PREV_WDATA 
 b'DUP DBG PREV WDATA'
*/
typedef struct reg_dup_dbg_prev_wdata {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_prev_wdata;
static_assert((sizeof(struct reg_dup_dbg_prev_wdata) == 4), "reg_dup_dbg_prev_wdata size is not 32-bit");
/*
 DUP_DBG_PREV_AWADDR 
 b'DUP DBG PREV AWADDR'
*/
typedef struct reg_dup_dbg_prev_awaddr {
	union {
		struct {
			uint32_t val : 29,
				_reserved29 : 3;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_prev_awaddr;
static_assert((sizeof(struct reg_dup_dbg_prev_awaddr) == 4), "reg_dup_dbg_prev_awaddr size is not 32-bit");
/*
 DUP_DBG_TOTAL_SERVED_REQ 
 b'DUP DBG TOTAL SERVED REQ'
*/
typedef struct reg_dup_dbg_total_served_req {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_total_served_req;
static_assert((sizeof(struct reg_dup_dbg_total_served_req) == 4), "reg_dup_dbg_total_served_req size is not 32-bit");
/*
 DUP_DBG_TOTAL_WR_REQ_CNT 
 b'DUP DBG TOTAL WR REQ CNT'
*/
typedef struct reg_dup_dbg_total_wr_req_cnt {
	union {
		struct {
			uint32_t val : 32;
		};
		uint32_t _raw;
	};
} reg_dup_dbg_total_wr_req_cnt;
static_assert((sizeof(struct reg_dup_dbg_total_wr_req_cnt) == 4), "reg_dup_dbg_total_wr_req_cnt size is not 32-bit");

#ifdef __cplusplus
} /* arc_dup_eng namespace */
#endif

/*
 ARC_DUP_ENG block
*/

#ifdef __cplusplus

struct block_arc_dup_eng {
	struct arc_dup_eng::reg_dup_addr_gr_0 dup_addr_gr_0[64];
	struct arc_dup_eng::reg_dup_addr_gr_1 dup_addr_gr_1[16];
	struct arc_dup_eng::reg_dup_addr_gr_2 dup_addr_gr_2[16];
	struct arc_dup_eng::reg_dup_addr_gr_3 dup_addr_gr_3[16];
	struct arc_dup_eng::reg_dup_addr_gr_4 dup_addr_gr_4[16];
	struct arc_dup_eng::reg_dup_addr_gr_5 dup_addr_gr_5[16];
	struct arc_dup_eng::reg_dup_addr_gr_6 dup_addr_gr_6[16];
	struct arc_dup_eng::reg_dup_addr_gr_7 dup_addr_gr_7[16];
	struct arc_dup_eng::reg_dup_addr_gr_8 dup_addr_gr_8[16];
	struct arc_dup_eng::reg_dup_addr_gr_9 dup_addr_gr_9[16];
	struct arc_dup_eng::reg_dup_addr_gr_10 dup_addr_gr_10[16];
	struct arc_dup_eng::reg_dup_addr_gr_11 dup_addr_gr_11[16];
